package homework;

public class Main {
    public static void main(String[] args) {
        /*Написать метод 100 раз печатающий символ и вывести на экран результат его
        работы для двух потоков (Например, один поток печатает # а второй *).
В конце работы на экран должно выводиться "end of main"*/
        Star star=new Star("Star");
        Hash hash=new Hash("Hash");
        star.start();
        hash.start();
        //Star starts
        //*Hash starts
        //#***#**#***#***#***#***#***#***#**#***#***#***#***#***#**#***#***#***#***#***#***#***#**#***#***#***#***#***#**#***#***#***#***#***#**#end of Star
        //################################################################end of Hash
    }
}
